Repository: lightlabcreation/Atlas-crm-python
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: As we continue to expand, our next milestone is bringing the same level of service to Saudi Arabia. Our mission is to help businesses scale confidently with dependable fulfillment, seamless warehousing, and a delivery network they can trust.
ar: مع استمرارنا في التوسع، فإن معلمتنا التالية هي تقديم نفس المستوى من الخدمة إلى المملكة العربية السعودية. مهمتنا هي مساعدة الشركات على التوسع بثقة مع استيفاء موثوق وتخزين سلس وشبكة توصيل يمكنهم الوثوق بها.

source: Email Address
ar: عنوان البريد الإلكتروني

source: Company Name
ar: اسم الشركة

source: Shipment Tracking
ar: تتبع الشحنة

source: Send us a Message
ar: أرسل لنا رسالة

source: Fill out the form below and we'll get back to you as soon as possible.
ar: املأ النموذج أدناه وسنعاود الاتصال بك في أقرب وقت ممكن.

source: Please describe your inquiry in detail...
ar: يرجى وصف استفسارك بالتفصيل...

source: Get in touch with our team. We're here to help you with all your logistics needs.
ar: تواصل مع فريقنا. نحن هنا لمساعدتك في جميع احتياجاتك اللوجستية.

source: Get in Touch
ar: تواصل معنا

source: We're here to help you with all your logistics needs. Reach out to us through any of the channels below.
ar: نحن هنا لمساعدتك في جميع احتياجاتك اللوجستية. تواصل معنا من خلال أي من القنوات أدناه.

source: Phone
ar: الهاتف

source: Call us for immediate assistance
ar: اتصل بنا للحصول على مساعدة فورية

source: Available 24/7
ar: متاح على مدار الساعة

source: Send us an email anytime
ar: أرسل لنا بريداً إلكترونياً في أي وقت

source: We'll respond within 24 hours
ar: سوف نرد خلال 24 ساعة

source: Address
ar: العنوان

source: Visit our warehouse
ar: قم بزيارة مستودعنا

source: View on Google Maps
ar: عرض على خرائط جوجل

source: Social Media
ar: وسائل التواصل الاجتماعي

source: Connect with us online
ar: تواصل معنا عبر الإنترنت

source: Find answers to common questions about our services
ar: ابحث عن إجابات للأسئلة الشائعة حول خدماتنا

source: Can I start working with Atlas Fulfilment?
ar: هل يمكنني البدء بالعمل مع أطلس فولفيلمنت؟

source: You can easily get started by registering on our website, after which you can choose the products you want to import or store. Our team will provide full support throughout the process.
ar: يمكنك البدء بسهولة من خلال التسجيل على موقعنا الإلكتروني، وبعد ذلك يمكنك اختيار المنتجات التي ترغب في استيرادها أو تخزينها. سيقدم فريقنا الدعم الكامل طوال العملية.

source: Yes, we help you import products from global markets such as China, Dubai, Europe, and others. We have a dedicated team that professionally manages the supply chain to ensure that goods arrive safely and on time.
ar: نعم، نساعدك على استيراد المنتجات من الأسواق العالمية مثل الصين ودبي وأوروبا وغيرها. لدينا فريق متخصص يدير سلسلة التوريد بشكل احترافي لضمان وصول البضائع بأمان وفي الوقت المحدد.

source: Does the company only provide storage services or are there other services?
ar: هل تقدم الشركة خدمات التخزين فقط أم أن هناك خدمات أخرى؟

source: We offer integrated logistics solutions that include: secure storage, professional packaging, order confirmation service, fast delivery, and more. We are also working on providing a product photography service soon.
ar: نقدم حلولاً لوجستية متكاملة تشمل: التخزين الآمن، التغليف الاحترافي، خدمة تأكيد الطلبات، التوصيل السريع، والمزيد. كما أننا نعمل على تقديم خدمة تصوير المنتجات قريباً.

source: How long does it take to deliver orders to customers?
ar: كم يستغرق تسليم الطلبات للعملاء؟

source: We always make sure to deliver orders on time based on the geographical location and nature of the product. Our team coordinates all steps to ensure fast and reliable delivery.
ar: نحرص دائماً على تسليم الطلبات في الوقت المحدد بناءً على الموقع الجغرافي وطبيعة المنتج. يتولى فريقنا تنسيق جميع الخطوات لضمان التوصيل السريع والموثوق.

source: How can I track the status of my orders?
ar: كيف يمكنني تتبع حالة طلباتي؟

source: We provide a dedicated order management platform where you can track the status of each order with transparency and flexibility. You will also receive regular updates on the status of orders until they are delivered to end customers.
ar: نوفر منصة مخصصة لإدارة الطلبات حيث يمكنك تتبع حالة كل طلب بشفافية ومرونة. كما ستتلقى تحديثات منتظمة حول حالة الطلبات حتى يتم تسليمها للعملاء النهائيين.

source: How are my profits transferred to me?
ar: كيف يتم تحويل أرباحي إلي؟

source: After the orders are successfully delivered, your earnings are transferred quickly and transparently. We follow the highest standards of security and clarity in financial transactions.
ar: بعد تسليم الطلبات بنجاح، يتم تحويل أرباحك بسرعة وشفافية. نتبع أعلى معايير الأمان والوضوح في المعاملات المالية.

source: Can I trust your storage services?
ar: هل يمكنني الوثوق بخدمات التخزين الخاصة بكم؟

source: Of course! We provide modern warehouses equipped with the latest technology to ensure that your goods are stored safely and efficiently. We adhere to the highest standards of quality and security to protect your products.
ar: بالطبع! نوفر مستودعات حديثة مجهزة بأحدث التقنيات لضمان تخزين بضائعك بأمان وكفاءة. نلتزم بأعلى معايير الجودة والأمان لحماية منتجاتك.

source: What happens if the products are damaged during delivery?
ar: ماذا يحدث إذا تعرضت المنتجات للتلف أثناء التسليم؟

source: We take full responsibility for the safety of the products during storage and delivery. In the event of any unexpected damage, we will compensate you in accordance with company policy.
ar: نتحمل المسؤولية الكاملة عن سلامة المنتجات أثناء التخزين والتسليم. في حالة حدوث أي تلف غير متوقع، سنعوضك وفقاً لسياسة الشركة.

source: What if some of the goods remain in storage and are not sold in the same country? Can I transfer them to another country?
ar: ماذا لو بقيت بعض البضائع في التخزين ولم تُبَع في نفس البلد؟ هل يمكنني نقلها إلى بلد آخر؟

source: Yes, if you have goods remaining in storage and they are not sold in the same country, you can easily transfer them to another country or even to Africa. We provide flexible solutions for redistributing your goods in line with market needs and your business plans.
ar: نعم، إذا كانت لديك بضائع متبقية في التخزين ولم تُبَع في نفس البلد، يمكنك بسهولة نقلها إلى بلد آخر أو حتى إلى أفريقيا. نوفر حلولاً مرنة لإعادة توزيع بضائعك بما يتماشى مع احتياجات السوق وخططك التجارية.

source: Ready to Get Started?
ar: هل أنت مستعد للبدء؟

source: Contact us today and let's discuss how we can help scale your business with our comprehensive logistics solutions.
ar: اتصل بنا اليوم ودعنا نناقش كيف يمكننا مساعدتك في توسيع أعمالك من خلال حلولنا اللوجستية الشاملة.

source: Call Now
ar: اتصل الآن

source: Warehouse N 6 Al Jerf Industrial 1
ar: المستودع رقم 6 الجرف الصناعي 1

source: Ajman, United Arab Emirates
ar: عجمان، الإمارات العربية المتحدة

source: Business Bay, Tower 1
ar: الخليج التجاري، برج 1
